Revit 2027 API
PhotometricWebLightDistribution(String, Double) Constructor
 Creates a photometric web light distribution object with the given filename and tilt.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PhotometricWebLightDistribution(
	string photometricWebFile,
	double tiltAngle
)
Public Sub New (
	photometricWebFile As String,
	tiltAngle As Double
)
public:
PhotometricWebLightDistribution(
	String^ photometricWebFile,
	double tiltAngle
)
new :
        photometricWebFile : string *
        tiltAngle : float -> PhotometricWebLightDistribution
Parameters
photometricWebFile String
 The filename of the IES file to use.
tiltAngle Double
 The tilt angle as a numerical value in degrees between -180.0 and 180.0.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The angle is not valid because it is not between -180.0 and 180.0.
See Also
Reference
PhotometricWebLightDistribution Class
PhotometricWebLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace